# Задача 2: Найдите сумму цифр трехзначного числа.
a = input('Введите трехзначное число: ')
print(int(a[0])+int(a[1])+int(a[2]))